import pandas as pd
import requests
import time
# API 세팅
url = 'http://apis.data.go.kr/1741000/ppltnDataStus/selectPpltnDataStus'
serviceKey = 's0223go+sRUY+iJgq65pNvDhwxCvlQNpNUYo74tgios3tV525izHLsxxHdULOuVj8K1y83GpRvdK7wjKcWk3VA=='

date_list = ['202407','202408','202409','202410','202411','202412']

def test_request_for_total_count(date):
    params = {
        "serviceKey": serviceKey,  # 개인 api key(decoding 버전)
        "mvinAdmmCd": "1000000000",  # 전입지역(전국 = 1000000000)
        "mvtAdmmCd": "1000000000",  # 전출지역(전국 = 1000000000)
        "srchFrYm": str(date),  # 조회기간(시작)
        "srchToYm": str(date),  # 조회기간(끝)
        "lv": "2",  # 광역시도 단위 : 1/ 시군구 단위 : 2/읍면동 단위 : 3
        "type": "JSON",  # 데이터 타입
        "numOfRows": "100",  # 페이지 크기
        "pageNo": "1",  # 페이지 번호
    }

    try:
        res = requests.get(url, params=params)
        test_data = res.json()
        total_count = int(test_data.get("Response", {}).get("head", {})['totalCount'])
        print(f"전체 {int(round(total_count / 100, 0) + 1)}페이지까지 탐색을 시작합니다")
        return total_count

    except Exception as e:
        print(e,"테스트 api 호출 실패")

    # 데이터 수집
def collect_data(date):
        """total_count에 맞게 페이지 탐색
        time sleep 건 후 다시 시작하게 하는 로직 추가 필요"""
        try:
            monthly_items = []
            total_count = test_request_for_total_count(date)   # 전체 데이터 수 확인

            for pageN0 in range(1,int(round(total_count/100,0)+1)):
                print(date,":",pageN0,"/",int(round(total_count/100,0)+1),"------")

                params = {
                    "serviceKey": serviceKey,       # 개인 api key(decoding 버전)
                    "mvinAdmmCd": "1000000000",     # 전입지역(전국 = 1000000000)
                    "mvtAdmmCd": "1000000000",      # 전출지역(전국 = 1000000000)
                    "srchFrYm": date,               # 조회기간(시작)
                    "srchToYm": date,               # 조회기간(끝)
                    "lv": "2",                      #광역시도 단위 : 1/ 시군구 단위 : 2/읍면동 단위 : 3
                    "type": "JSON",                 # 데이터 타입
                    "numOfRows": "100",             # 페이지 크기
                    "pageNo": pageN0,               # 페이지 번호
                }

                # api호출
                res = requests.get(url,params=params)

                json_data = res.json()              # json 파일로 만들기
                items = json_data.get("Response", {}).get("items", {}).get("item", []) # items.item 데이터 잘라내기
                monthly_items.extend(items)     # list에 데이터 append

            # 컬럼 이름 및 컬럼 순서 정리 전처리 필요
            df = pd.DataFrame(monthly_items)
            return df

        except Exception as e:
            print(e,"에러가 발생했습니다.")
            print("마지막으로 저장된 부분까지 df 변수화 진행합니다")
            df = pd.DataFrame(monthly_items)
            return df
def rename_order_columns(df):
    # 변경할 이름 매핑
    manual_mapping  = {
        "statsYm":      "통계년월",
        "mvinAdmmCd":   "전입행정기관코드",
        "mvinCtpvNm":   "전입시도명",
        "mvinSggNm":    "전입시군구명",
        "mvtAdmmCd":    "전출행정기관코드",
        "mvtCtpvNm":    "전출시도명",
        "mvtSggNm":     "전출시군구명",
        "totNmprCnt":   "총인구수",
        "maleNmprCnt":  "남자인구수",
        "femlNmprCnt":  "여자인구수"
    }

    # 성별/연령 컬럼 매핑하기
    age_gender_mapping = {}
    for col in df.columns:
        if col.startswith("male") and col.endswith("AgeNmprCnt"):
            age = col[4:-10]  # 'male6AgeNmprCnt' -> '6'
            age_gender_mapping[col] = f"만{age}세남자"
        elif col.startswith("feml") and col.endswith("AgeNmprCnt"):
            age = col[4:-10]  # 'feml11AgeNmprCnt' -> '11'
            age_gender_mapping[col] = f"만{age}세여자"

    # 모든 매핑 합치기
    column_mapping = {**manual_mapping, **age_gender_mapping}
    df = df.rename(columns=column_mapping)

    # 컬럼 순서대로 정의
    desired_columns = ["통계년월",
                       "전입행정기관코드",
                       "전입시도명",
                       "전입시군구명",
                       "전출행정기관코드",
                       "전출시도명",
                       "전출시군구명",
                       "총인구수",
                       "남자인구수",
                       "여자인구수",
                       "만0세남자",
                       "만1세남자",
                       "만2세남자",
                       "만3세남자",
                       "만4세남자",
                       "만5세남자",
                       "만6세남자",
                       "만7세남자",
                       "만8세남자",
                       "만9세남자",
                       "만10세남자",
                       "만11세남자",
                       "만12세남자",
                       "만13세남자",
                       "만14세남자",
                       "만15세남자",
                       "만16세남자",
                       "만17세남자",
                       "만18세남자",
                       "만19세남자",
                       "만20세남자",
                       "만21세남자",
                       "만22세남자",
                       "만23세남자",
                       "만24세남자",
                       "만25세남자",
                       "만26세남자",
                       "만27세남자",
                       "만28세남자",
                       "만29세남자",
                       "만30세남자",
                       "만31세남자",
                       "만32세남자",
                       "만33세남자",
                       "만34세남자",
                       "만35세남자",
                       "만36세남자",
                       "만37세남자",
                       "만38세남자",
                       "만39세남자",
                       "만40세남자",
                       "만41세남자",
                       "만42세남자",
                       "만43세남자",
                       "만44세남자",
                       "만45세남자",
                       "만46세남자",
                       "만47세남자",
                       "만48세남자",
                       "만49세남자",
                       "만50세남자",
                       "만51세남자",
                       "만52세남자",
                       "만53세남자",
                       "만54세남자",
                       "만55세남자",
                       "만56세남자",
                       "만57세남자",
                       "만58세남자",
                       "만59세남자",
                       "만60세남자",
                       "만61세남자",
                       "만62세남자",
                       "만63세남자",
                       "만64세남자",
                       "만65세남자",
                       "만66세남자",
                       "만67세남자",
                       "만68세남자",
                       "만69세남자",
                       "만70세남자",
                       "만71세남자",
                       "만72세남자",
                       "만73세남자",
                       "만74세남자",
                       "만75세남자",
                       "만76세남자",
                       "만77세남자",
                       "만78세남자",
                       "만79세남자",
                       "만80세남자",
                       "만81세남자",
                       "만82세남자",
                       "만83세남자",
                       "만84세남자",
                       "만85세남자",
                       "만86세남자",
                       "만87세남자",
                       "만88세남자",
                       "만89세남자",
                       "만90세남자",
                       "만91세남자",
                       "만92세남자",
                       "만93세남자",
                       "만94세남자",
                       "만95세남자",
                       "만96세남자",
                       "만97세남자",
                       "만98세남자",
                       "만99세남자",
                       "만100세남자",
                       "만101세남자",
                       "만102세남자",
                       "만103세남자",
                       "만104세남자",
                       "만105세남자",
                       "만106세남자",
                       "만107세남자",
                       "만108세남자",
                       "만109세남자",
                       "만110세남자",
                       "만0세여자",
                       "만1세여자",
                       "만2세여자",
                       "만3세여자",
                       "만4세여자",
                       "만5세여자",
                       "만6세여자",
                       "만7세여자",
                       "만8세여자",
                       "만9세여자",
                       "만10세여자",
                       "만11세여자",
                       "만12세여자",
                       "만13세여자",
                       "만14세여자",
                       "만15세여자",
                       "만16세여자",
                       "만17세여자",
                       "만18세여자",
                       "만19세여자",
                       "만20세여자",
                       "만21세여자",
                       "만22세여자",
                       "만23세여자",
                       "만24세여자",
                       "만25세여자",
                       "만26세여자",
                       "만27세여자",
                       "만28세여자",
                       "만29세여자",
                       "만30세여자",
                       "만31세여자",
                       "만32세여자",
                       "만33세여자",
                       "만34세여자",
                       "만35세여자",
                       "만36세여자",
                       "만37세여자",
                       "만38세여자",
                       "만39세여자",
                       "만40세여자",
                       "만41세여자",
                       "만42세여자",
                       "만43세여자",
                       "만44세여자",
                       "만45세여자",
                       "만46세여자",
                       "만47세여자",
                       "만48세여자",
                       "만49세여자",
                       "만50세여자",
                       "만51세여자",
                       "만52세여자",
                       "만53세여자",
                       "만54세여자",
                       "만55세여자",
                       "만56세여자",
                       "만57세여자",
                       "만58세여자",
                       "만59세여자",
                       "만60세여자",
                       "만61세여자",
                       "만62세여자",
                       "만63세여자",
                       "만64세여자",
                       "만65세여자",
                       "만66세여자",
                       "만67세여자",
                       "만68세여자",
                       "만69세여자",
                       "만70세여자",
                       "만71세여자",
                       "만72세여자",
                       "만73세여자",
                       "만74세여자",
                       "만75세여자",
                       "만76세여자",
                       "만77세여자",
                       "만78세여자",
                       "만79세여자",
                       "만80세여자",
                       "만81세여자",
                       "만82세여자",
                       "만83세여자",
                       "만84세여자",
                       "만85세여자",
                       "만86세여자",
                       "만87세여자",
                       "만88세여자",
                       "만89세여자",
                       "만90세여자",
                       "만91세여자",
                       "만92세여자",
                       "만93세여자",
                       "만94세여자",
                       "만95세여자",
                       "만96세여자",
                       "만97세여자",
                       "만98세여자",
                       "만99세여자",
                       "만100세여자",
                       "만101세여자",
                       "만102세여자",
                       "만103세여자",
                       "만104세여자",
                       "만105세여자",
                       "만106세여자",
                       "만107세여자",
                       "만108세여자",
                       "만109세여자",
                       "만110세여자"]
    # 순서 정리
    df = df[desired_columns]

    # 컬럼 타입 재정의
    df[["총인구수","남자인구수","여자인구수","만0세남자","만1세남자","만2세남자","만3세남자","만4세남자","만5세남자","만6세남자","만7세남자","만8세남자","만9세남자","만10세남자","만11세남자","만12세남자","만13세남자","만14세남자","만15세남자","만16세남자","만17세남자","만18세남자","만19세남자","만20세남자","만21세남자","만22세남자","만23세남자","만24세남자","만25세남자","만26세남자","만27세남자","만28세남자","만29세남자","만30세남자","만31세남자","만32세남자","만33세남자","만34세남자","만35세남자","만36세남자","만37세남자","만38세남자","만39세남자","만40세남자","만41세남자","만42세남자","만43세남자","만44세남자","만45세남자","만46세남자","만47세남자","만48세남자","만49세남자","만50세남자","만51세남자","만52세남자","만53세남자","만54세남자","만55세남자","만56세남자","만57세남자","만58세남자","만59세남자","만60세남자","만61세남자","만62세남자","만63세남자","만64세남자","만65세남자","만66세남자","만67세남자","만68세남자","만69세남자","만70세남자","만71세남자","만72세남자","만73세남자","만74세남자","만75세남자","만76세남자","만77세남자","만78세남자","만79세남자","만80세남자","만81세남자","만82세남자","만83세남자","만84세남자","만85세남자","만86세남자","만87세남자","만88세남자","만89세남자","만90세남자","만91세남자","만92세남자","만93세남자","만94세남자","만95세남자","만96세남자","만97세남자","만98세남자","만99세남자","만100세남자","만101세남자","만102세남자","만103세남자","만104세남자","만105세남자","만106세남자","만107세남자","만108세남자","만109세남자","만110세남자","만0세여자","만1세여자","만2세여자","만3세여자","만4세여자","만5세여자","만6세여자","만7세여자","만8세여자","만9세여자","만10세여자","만11세여자","만12세여자","만13세여자","만14세여자","만15세여자","만16세여자","만17세여자","만18세여자","만19세여자","만20세여자","만21세여자","만22세여자","만23세여자","만24세여자","만25세여자","만26세여자","만27세여자","만28세여자","만29세여자","만30세여자","만31세여자","만32세여자","만33세여자","만34세여자","만35세여자","만36세여자","만37세여자","만38세여자","만39세여자","만40세여자","만41세여자","만42세여자","만43세여자","만44세여자","만45세여자","만46세여자","만47세여자","만48세여자","만49세여자","만50세여자","만51세여자","만52세여자","만53세여자","만54세여자","만55세여자","만56세여자","만57세여자","만58세여자","만59세여자","만60세여자","만61세여자","만62세여자","만63세여자","만64세여자","만65세여자","만66세여자","만67세여자","만68세여자","만69세여자","만70세여자","만71세여자","만72세여자","만73세여자","만74세여자","만75세여자","만76세여자","만77세여자","만78세여자","만79세여자","만80세여자","만81세여자","만82세여자","만83세여자","만84세여자","만85세여자","만86세여자","만87세여자","만88세여자","만89세여자","만90세여자","만91세여자","만92세여자","만93세여자","만94세여자","만95세여자","만96세여자","만97세여자","만98세여자","만99세여자","만100세여자","만101세여자","만102세여자","만103세여자","만104세여자","만105세여자","만106세여자","만107세여자","만108세여자","만109세여자","만110세여자"]] = df[["총인구수","남자인구수","여자인구수","만0세남자","만1세남자","만2세남자","만3세남자","만4세남자","만5세남자","만6세남자","만7세남자","만8세남자","만9세남자","만10세남자","만11세남자","만12세남자","만13세남자","만14세남자","만15세남자","만16세남자","만17세남자","만18세남자","만19세남자","만20세남자","만21세남자","만22세남자","만23세남자","만24세남자","만25세남자","만26세남자","만27세남자","만28세남자","만29세남자","만30세남자","만31세남자","만32세남자","만33세남자","만34세남자","만35세남자","만36세남자","만37세남자","만38세남자","만39세남자","만40세남자","만41세남자","만42세남자","만43세남자","만44세남자","만45세남자","만46세남자","만47세남자","만48세남자","만49세남자","만50세남자","만51세남자","만52세남자","만53세남자","만54세남자","만55세남자","만56세남자","만57세남자","만58세남자","만59세남자","만60세남자","만61세남자","만62세남자","만63세남자","만64세남자","만65세남자","만66세남자","만67세남자","만68세남자","만69세남자","만70세남자","만71세남자","만72세남자","만73세남자","만74세남자","만75세남자","만76세남자","만77세남자","만78세남자","만79세남자","만80세남자","만81세남자","만82세남자","만83세남자","만84세남자","만85세남자","만86세남자","만87세남자","만88세남자","만89세남자","만90세남자","만91세남자","만92세남자","만93세남자","만94세남자","만95세남자","만96세남자","만97세남자","만98세남자","만99세남자","만100세남자","만101세남자","만102세남자","만103세남자","만104세남자","만105세남자","만106세남자","만107세남자","만108세남자","만109세남자","만110세남자","만0세여자","만1세여자","만2세여자","만3세여자","만4세여자","만5세여자","만6세여자","만7세여자","만8세여자","만9세여자","만10세여자","만11세여자","만12세여자","만13세여자","만14세여자","만15세여자","만16세여자","만17세여자","만18세여자","만19세여자","만20세여자","만21세여자","만22세여자","만23세여자","만24세여자","만25세여자","만26세여자","만27세여자","만28세여자","만29세여자","만30세여자","만31세여자","만32세여자","만33세여자","만34세여자","만35세여자","만36세여자","만37세여자","만38세여자","만39세여자","만40세여자","만41세여자","만42세여자","만43세여자","만44세여자","만45세여자","만46세여자","만47세여자","만48세여자","만49세여자","만50세여자","만51세여자","만52세여자","만53세여자","만54세여자","만55세여자","만56세여자","만57세여자","만58세여자","만59세여자","만60세여자","만61세여자","만62세여자","만63세여자","만64세여자","만65세여자","만66세여자","만67세여자","만68세여자","만69세여자","만70세여자","만71세여자","만72세여자","만73세여자","만74세여자","만75세여자","만76세여자","만77세여자","만78세여자","만79세여자","만80세여자","만81세여자","만82세여자","만83세여자","만84세여자","만85세여자","만86세여자","만87세여자","만88세여자","만89세여자","만90세여자","만91세여자","만92세여자","만93세여자","만94세여자","만95세여자","만96세여자","만97세여자","만98세여자","만99세여자","만100세여자","만101세여자","만102세여자","만103세여자","만104세여자","만105세여자","만106세여자","만107세여자","만108세여자","만109세여자","만110세여자"]].apply(pd.to_numeric)

    return df
def save_df(df,date):
    df.to_excel(f"{date}_지역별 인구이동.xlsx",index=False)
    print(f"{date}_지역별 인구이동.xlsx 파일 저장을 완료하였습니다. 10초 후 다음 일자 데이터 수집을 시작합니다.")
    time.sleep(10)  # 10초 타입슬립



for date in date_list:
    print(date,"일자 지자체 이동 데이터 수집을 시작합니다--------------------------------")
    df = collect_data(date)
    df = rename_order_columns(df)
    save_df(df,date)









